Revit 2027 API
BuiltInFailures.SiteFailures.NoHostForSubregion Property
 This Subregion now does not appear to overlap any Toposurface with an appropriate Phase and Design Option.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoHostForSubregion { get; }
Public Shared ReadOnly Property NoHostForSubregion As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoHostForSubregion {
	FailureDefinitionId^ get ();
}
static member NoHostForSubregion : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace